load_testing/results_for_report/cons_hash_3_peaks_360s_10keys_500r.txt
wrk -t2 -c200 --timeout 15s --latency -s readLineByLine.lua -d360s -R500 http://172.31.0.222:3000/
CONNECTED to addr       172.31.0.222:3000
CONNECTED to addr       172.31.3.106:3000
all addrs:
1       172.31.0.222:3000
2       172.31.3.106:3000
thread addr: 172.31.0.222:3000
all addrs:
1       172.31.0.222:3000
2       172.31.3.106:3000
thread addr: 172.31.3.106:3000
Running 6m test @ http://172.31.0.222:3000/
  2 threads and 200 connections
  Thread calibration: mean lat.: 858.829ms, rate sampling interval: 5758ms
  Thread calibration: mean lat.: 880.016ms, rate sampling interval: 5894ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.08ms   13.38ms 832.51ms   89.77%
    Req/Sec   249.43      1.34   252.00     88.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.82ms
 75.000%    5.09ms
 90.000%   20.94ms
 99.000%   41.82ms
 99.900%  142.21ms
 99.990%  482.30ms
 99.999%  642.56ms
100.000%  833.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.376     0.000000            1         1.00
       1.999     0.100000        17487         1.11
       2.237     0.200000        34952         1.25
       2.435     0.300000        52440         1.43
       2.617     0.400000        69897         1.67
       2.815     0.500000        87402         2.00
       2.937     0.550000        96136         2.22
       3.093     0.600000       104851         2.50
       3.319     0.650000       113602         2.86
       3.767     0.700000       122306         3.33
       5.091     0.750000       131045         4.00
       7.319     0.775000       135410         4.44
      10.143     0.800000       139801         5.00
      11.519     0.825000       144162         5.71
      13.511     0.850000       148521         6.67
      16.639     0.875000       152891         8.00
      18.575     0.887500       155070         8.89
      20.943     0.900000       157252        10.00
      23.135     0.912500       159444        11.43
      24.351     0.925000       161645        13.33
      25.455     0.937500       163801        16.00
      26.095     0.943750       164919        17.78
      26.799     0.950000       166013        20.00
      27.599     0.956250       167081        22.86
      28.575     0.962500       168190        26.67
      29.631     0.968750       169265        32.00
      30.335     0.971875       169812        35.56
      31.231     0.975000       170353        40.00
      32.415     0.978125       170909        45.71
      33.951     0.981250       171458        53.33
      35.839     0.984375       171991        64.00
      37.087     0.985938       172265        71.11
      38.687     0.987500       172540        80.00
      40.415     0.989062       172812        91.43
      42.815     0.990625       173083       106.67
      45.855     0.992188       173358       128.00
      47.871     0.992969       173494       142.22
      50.335     0.993750       173629       160.00
      53.151     0.994531       173766       182.86
      56.863     0.995313       173903       213.33
      62.559     0.996094       174040       256.00
      66.431     0.996484       174107       284.44
      70.975     0.996875       174175       320.00
      77.247     0.997266       174244       365.71
      86.271     0.997656       174312       426.67
      95.935     0.998047       174381       512.00
     102.143     0.998242       174414       568.89
     112.255     0.998437       174448       640.00
     119.103     0.998633       174483       731.43
     127.295     0.998828       174517       853.33
     143.359     0.999023       174551      1024.00
     149.631     0.999121       174569      1137.78
     156.159     0.999219       174585      1280.00
     173.951     0.999316       174602      1462.86
     197.631     0.999414       174619      1706.67
     221.567     0.999512       174636      2048.00
     235.647     0.999561       174645      2275.56
     249.855     0.999609       174653      2560.00
     269.823     0.999658       174662      2925.71
     291.071     0.999707       174670      3413.33
     366.847     0.999756       174679      4096.00
     386.303     0.999780       174683      4551.11
     396.031     0.999805       174687      5120.00
     409.599     0.999829       174692      5851.43
     434.943     0.999854       174696      6826.67
     450.047     0.999878       174700      8192.00
     462.079     0.999890       174702      9102.22
     482.303     0.999902       174704     10240.00
     510.719     0.999915       174707     11702.86
     513.279     0.999927       174709     13653.33
     529.407     0.999939       174712     16384.00
     529.407     0.999945       174712     18204.44
     530.943     0.999951       174714     20480.00
     530.943     0.999957       174714     23405.71
     548.351     0.999963       174715     27306.67
     552.959     0.999969       174716     32768.00
     583.679     0.999973       174717     36408.89
     583.679     0.999976       174717     40960.00
     638.975     0.999979       174718     46811.43
     638.975     0.999982       174718     54613.33
     642.559     0.999985       174719     65536.00
     642.559     0.999986       174719     72817.78
     642.559     0.999988       174719     81920.00
     757.759     0.999989       174720     93622.86
     757.759     0.999991       174720    109226.67
     757.759     0.999992       174720    131072.00
     757.759     0.999993       174720    145635.56
     757.759     0.999994       174720    163840.00
     833.023     0.999995       174721    187245.71
     833.023     1.000000       174721          inf
#[Mean    =        7.078, StdDeviation   =       13.377]
#[Max     =      832.512, Total count    =       174721]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179961 requests in 6.00m, 46.27MB read
  Non-2xx or 3xx responses: 487
Requests/sec:    499.89
Transfer/sec:    131.61KB
thread 0 made 89983 requests and got 89980 responses
thread 1 made 89982 requests and got 89981 responses
2022-06-05 05:27:16.726 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN 
2022-06-05 05:27:21.763 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.6408839779005524 
2022-06-05 05:27:26.731 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0039584364176153 
2022-06-05 05:27:31.733 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.963978849966953 
2022-06-05 05:27:36.735 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.983851433185305 
2022-06-05 05:27:41.739 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.98967434471803 
2022-06-05 05:27:46.737 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9196608800968915 
2022-06-05 05:27:51.741 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.018658197697499 
2022-06-05 05:27:56.741 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0205811138014527 
2022-06-05 05:28:01.760 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9527965093216977 
2022-06-05 05:28:06.747 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9737161342498988 
2022-06-05 05:28:11.749 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9634630659253376 
2022-06-05 05:28:16.751 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9430992736077481 
2022-06-05 05:28:21.753 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8893312101910826 
2022-06-05 05:28:26.758 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.015738498789346 
2022-06-05 05:28:31.758 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.963831478537361 
2022-06-05 05:28:36.758 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9366168752523214 
2022-06-05 05:28:41.759 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.01231135822081 
2022-06-05 05:28:46.794 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9100806451612904 
2022-06-05 05:28:51.770 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0463258785942493 
2022-06-05 05:28:56.765 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9361873990306946 
2022-06-05 05:29:01.786 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.018658197697499 
2022-06-05 05:29:06.782 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.926060606060606 
2022-06-05 05:29:11.771 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9427207637231503 
2022-06-05 05:29:16.780 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0274193548387096 
2022-06-05 05:29:21.780 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9654350417163289 
2022-06-05 05:29:26.779 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0092854259184496 
2022-06-05 05:29:31.780 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.023034154090548 
2022-06-05 05:29:36.782 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.225181598062954 
2022-06-05 05:29:41.786 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.068705321683876 
2022-06-05 05:29:46.787 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1476997578692494 
2022-06-05 05:29:51.811 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1687847498014297 
2022-06-05 05:29:56.796 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1169566976932417 
2022-06-05 05:30:01.962 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1137083993660855 
2022-06-05 05:30:06.797 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.093970893970894 
2022-06-05 05:30:11.795 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.096108022239873 
2022-06-05 05:30:16.797 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2009685230024214 
2022-06-05 05:30:21.799 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.2235901509134233 
2022-06-05 05:30:26.802 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.069007263922518 
2022-06-05 05:30:31.803 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1179976162097736 
2022-06-05 05:30:36.810 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.172650262202501 
2022-06-05 05:30:41.809 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1632896305125149 
2022-06-05 05:30:46.812 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1380145278450364 
2022-06-05 05:30:51.815 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1988095238095238 
2022-06-05 05:30:56.814 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1074313408723748 
2022-06-05 05:31:01.817 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1971383147853736 
2022-06-05 05:31:06.831 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.170024174053183 
2022-06-05 05:31:11.820 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1580838323353293 
2022-06-05 05:31:16.821 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.178225806451613 
2022-06-05 05:31:21.824 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.114695340501792 
2022-06-05 05:31:26.830 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.170024174053183 
2022-06-05 05:31:31.829 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1767757382282522 
2022-06-05 05:31:36.831 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0954106280193237 
2022-06-05 05:31:41.833 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1604790419161677 
2022-06-05 05:31:46.836 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.176588897827836 
2022-06-05 05:31:51.860 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.150438946528332 
2022-06-05 05:31:56.838 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0912394025030279 
2022-06-05 05:32:01.887 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1167795934635312 
2022-06-05 05:32:06.848 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1280487804878048 
2022-06-05 05:32:11.849 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1243999999999998 
2022-06-05 05:32:16.861 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0647106109324758 
2022-06-05 05:32:21.867 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1609795262946607 
2022-06-05 05:32:26.851 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0383219039935458 
2022-06-05 05:32:31.851 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1750599520383693 
2022-06-05 05:32:36.855 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0853365384615385 
2022-06-05 05:32:41.854 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1663999999999999 
2022-06-05 05:32:46.862 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1542168674698796 
2022-06-05 05:32:51.863 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0729751403368082 
2022-06-05 05:32:56.860 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.0757211538461537 
2022-06-05 05:33:01.866 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.078125 
2022-06-05 05:33:06.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1192954363490792 
2022-06-05 05:33:11.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1371841155234657 
2022-06-05 05:33:16.872 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.1112 
2022-06-05 05:33:21.873 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.049165120593692 
2022-06-05 05:33:26.874 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN